/**
  ******************************************************************************
  * @file           : gpio.h
  * @brief          : header file
  ******************************************************************************
  * @attention
  *
  * Copyright: https://blog.csdn.net/qq_30155503
  * All rights reserved.
  *
  ******************************************************************************
  */

#ifndef _GPIO_H_
#define _GPIO_H_

/*****************************************************************
* 包含头文件
******************************************************************/
#include "stm32f1xx_hal.h"
#include "typedef.h"

/*****************************************************************
* 宏定义
******************************************************************/
#define WDG_WDI_Pin GPIO_PIN_8
#define WDG_WDI_GPIO_Port GPIOA
#define INTTL_TX1_Pin GPIO_PIN_9
#define INTTL_TX1_GPIO_Port GPIOA
#define INTTL_RX1_Pin GPIO_PIN_10
#define INTTL_RX1_GPIO_Port GPIOA
#define DB_TX5_Pin GPIO_PIN_12
#define DB_TX5_GPIO_Port GPIOC
#define DB_RX5_Pin GPIO_PIN_2
#define DB_RX5_GPIO_Port GPIOD

/*****************************************************************
* 结构、枚举定义
******************************************************************/

/* IO功能:开/关 */
typedef enum
{
	STATE_ON = 0U,
	STATE_OFF
}IOFUNC_State;

/*****************************************************************
* 全局变量声明
******************************************************************/

/*****************************************************************
* 函数原型声明
******************************************************************/
void GPIO_feedDog(void);

void MX_GPIO_Init(void);


#endif
